1s/ERP/Conf/Documents/Лико_ТестированиеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ТестированиеМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_РезультатыТестированияМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ОперацииТестированиеМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ДаНет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПисьмоСОтрицательнымРезультатомВКОтправлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тесты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тест</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ТестыМатериалов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ПримечанияТестыМатериалов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_РезультатыТестированияМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_РезультатыТестированияМатериалов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ПримечанияТестыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатТеста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ОперацииТестированиеМатериалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тест</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТестыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ТестированиеМатериалов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Лико_РезультатыТестированияМатериалов
	Движения.Лико_РезультатыТестированияМатериалов.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
				
		СтрокиТестов = тесты.НайтиСтроки(новый структура("КлючСтроки", ТекСтрокаТовары.КлючСтроки));
		Для каждого стр из СтрокиТестов цикл  
			
			Движение = Движения.Лико_РезультатыТестированияМатериалов.Добавить();
			Движение.Период = Дата;
			Движение.Партия = ТекСтрокаТовары.Партия;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура; 
			Движение.Серия = ТекСтрокаТовары.Серия;

			
			Движение.Тест = стр.Тест; 

			Движение.РезультатТеста = стр.Результат; 
			Движение.Примечание = стр.Примечание;
			Движение.Результат = ТекСтрокаТовары.Результат;
			Движение.ВидОперации = ВидОперации;
		КонецЦикла;
		
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Результат",Перечисления.Лико_ДаНет.Нет));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Результат = Перечисления.Лико_ДаНет.Нет;
	Иначе
		Результат = Перечисления.Лико_ДаНет.Да;
	КонецЕсли;
	
КонецПроцедуры
